[
    {
        "id": 1,
        "title": "Outbound Account Executive",
        "role": "As an Outbound Account Executive, you will have the opportunity to work with Phis largest line of revenue. We are looking For sales professionals who are competitive, driven, strongcommunicators, and consistently practice refining their skill set. You should be humble, coachable, and relentless toward hitting your goals and targets.",
        
        "content": [
           
            {"type": "subheading", "text": "About Us"},
            {"type": "paragraph", "text": "Phi Consulting constructs innovation involving the most recent progressions in Information Technology. Working with Industry accredited clients who are positioned in the market as fastest growing fintech companies and listed in Forbes 100. At Phi Consulting, we see our diligent effort compensated in remarkable ways consistently, and we acknowledge that knowledge is most integral when matched with lowliness. We’re roused by the chance to save lives out and about while affecting and working on each feature of numerous million-dollar enterprises that keep our actual economy moving."},
            
            {"type": "subheading", "text": "About The Role"},
            {"type": "paragraph", "text": "As an Outbound Account Executive, you’ll have the opportunity to work with Phi’s largest line of revenue. We are looking For sales professionals who are competitive, driven, strong communicators, and consistently practice refining their skill set. You should be humble,coachable, and relentless toward hitting your goals and targets."},
            {"type": "subheading", "text": "What An Account Executive is expected to do:"},
            {"type": "paragraph", "text": "Making outbound calls, and prospecting new businesses in our target market pool in the US transportation industry."},
            
            {"type": "paragraph", "text": "Ensuring your pipeline is regularly maintained and you are able to grow your pipeline at an excellent pace"},
            {"type": "paragraph", "text": "Building rapport with the prospect and identifying the pain points and providing a just solution that will not only address their concern but also add value to their business."},
            {"type": "paragraph", "text": "Achieve KPIs on a daily basis. You should not only be able to achieve your monthly & quarterly quotas but should also have a strong desire to exceed those targets regularly."},
            
            {"type": "subheading", "text": "What We’re Looking For"},
            {"type": "paragraph", "text": "Minimum of 1 to 2 years of work experience. Sales experience is a plus."},
            
            {"type": "paragraph", "text": "Demonstrated ability to achieve goals."},
            
            {"type": "paragraph", "text": "Must be a self-starter, who empowers themselves and others to learn in a quickly evolving environment."},
            {"type": "paragraph", "text": "Excellent written and verbal communication skills. Ability to multitask in a fast-paced environment."},
            {"type": "paragraph", "text": "Thrives with change."},
            {"type": "paragraph", "text": "Experience with CRM based sales Pipelines, MS Office tools, and general technical aptitude preferred."}

        ]
    }
   
]